package day3;

/*1. Реализовать программу, используя switch, которая в консоль выводит название страны,
принимая на вход название города.
        Реализовать, используя следующие данные:
        Москва, Владивосток, Ростов - Россия
        Рим, Милан, Турин - Италия
        Ливерпуль, Манчестер, Лондон - Англия
        Берлин, Мюнхен, Кёльн - Германия
        При вводе любого другого города, вывести сообщение “Неизвестная страна”.*/

import java.util.ArrayList;
import java.util.List;
import java.util.Scanner;

public class Task1 {

}