package day4;

import java.util.Random;

public class Task4 {
    public static void main(String[] args) {
     /*   Создать новый массив размера 100 и заполнить его случайными числами из диапазона от 0 до 10000.
        Найти максимум среди сумм трех соседних элементов. Для найденной тройки с максимальной суммой выведите значение суммы
         и индекс первого элемента тройки.
        Пример:
*Для простоты пример показан на массиве размера 10
                [1, 456, 1025, 65, 954, 2789, 4, 8742, 1040, 3254]*/

        // int[] array = {1, 456, 1025, 65, 954, 2789, 4, 8742, 1040, 3254};

    }

}